Repository: Indi-An/PLCcomforS7-examples-dotnet
Catalog: Full-Test-App/Properties/Resources.*.resx
Languages: de

# btnAbort_Text
source: abort
de: Abbruch

# btnAcceptRequest_Text
source: accept request
de: Request erzeugen

# btnAccept_Text
source: accept connector
de: übernehme Connector

# btnAddConnector_Text
source: add connector
de: Connector hinzufügen

# btnAddRequest_Text
source: add request
de: Requests hinzufügen

# btnBackup_Block_Text
source: backup block
de: lese Block

# btnBasicInfo_Text
source: get PLC info
de: lese SPS Info

# btnBlockFunctions_Text
source: block functions
de: Block- funktionen

# btnBlockLen_Text
source: get PLC blocklength
de: lese Blocklänge

# btnBlockList_Text
source: get PLC blocklist
de: lese Blockliste

# btnClose_Text
source: close
de: schliessen

# btnConnect_Text
source: connect to PLC
de: SPS Verbinden

# btnCPUMode_Text
source: get CPU mode
de: lese CPU Modus

# btnDeleteBlock_Text
source: delete block
de: lösche Block

# btnDiagnoseBuffer_Text
source: diagnostic data
de: Diagnose- daten

# btnDisconnect_Text
source: disconnect from PLC
de: SPS Trennen

# btnEditConnectionSettings_Text
source: edit settings
de: Einstellung ändern

# btnExecute_Text
source: execute function
de: Funktion ausführen

# btnGetPLCTime_Text
source: get PLC time
de: lese SPS Uhr

# btnLoadRequests_Text
source: load requests
de: Lade Requests

# btnLoggingSettings_Text
source: logging connectors
de: Log- Konnektor

# btnOptimizedReadWrite_Text
source: optimize access
de: optimierter Zugriff

# btnOtherFunctions_Text
source: other functions
de: weitere Funktionen

# btnPLCLEDInfo_Text
source: get LED info
de: lese LED info

# btnreadBCD_Text
source: read bcd
de: lese BCD

# btnreadBit_Text
source: read bit
de: lese Bit

# btnreadBuffer_Text
source: read rawdata
de: lese Rohdaten

# btnReadBytes_Text
source: read byte
de: lese Byte

# btnReadCollection_Text
source: read collection
de: lese Collection

# btnreadDInt_Text
source: read dint
de: lese DInt

# btnreadDT_Text
source: read datetime
de: lese Datetime

# btnreadDWORD_Text
source: read dword
de: lese DWord

# btnReadExample_Text
source: read functions
de: Lese- funktionen

# btnreadInt_Text
source: read int
de: lese Int

# btnreadReal_Text
source: read real
de: lese Real

# btnreadS5Time_Text
source: read S5Time
de: lese S5Time

# btnreadS7_String_Text
source: read s7string
de: lese S7String

# btnReadSSL_SZL_Text
source: read SSL
de: lese SZL

# btnreadString_Text
source: read string
de: lese String

# btnreadWord_Text
source: read word
de: lese Word

# btnReadWriteFunctions_Text
source: simple access
de: einfacher Zugriff

# btnReject_Text
source: reject connector
de: verwerfe Connector

# btnRemoveConnector_Text
source: remove connector
de: Connector entfernen

# btnRemoveRequest_Text
source: remove request
de: Requests entfernen

# btnRestore_Block_Text
source: restore block
de: schreibe Block

# btnSaveConnectionSettings_Text
source: save settings
de: Einstellung speichern

# btnSaveLogtoClipboard_Text
source: save log to clipboard
de: Zwischen-ablage

# btnSaveLogtoFile_Text
source: save log to file
de: Speichere in Datei

# btnSaveRequests_Text
source: save requests
de: Speichere Requests

# btnsendPW_Text
source: send password
de: sende Password

# btnsetPLCTime_Text
source: set PLC time
de: setze SPS Uhr

# btnStartPLC_Text
source: start PLC
de: Start SPS

# btnStartServer_Text
source: run data server
de: Start Dataserver

# btnStopPLC_Text
source: stop PLC
de: Stop SPS

# btnwriteBCD_Text
source: write bcd
de: schreibe BCD

# btnwriteBit_Text
source: write bit
de: schreibe Bit

# btnwriteBuffer_Text
source: write rawdata
de: schreibe Rohdaten

# btnwriteByte_Text
source: write byte
de: schreibe Byte

# btnwriteDInt_Text
source: write dint
de: schreibe DInt

# btnwriteDT_Text
source: write datetime
de: schreibe Datetime

# btnwriteDWord_Text
source: write dword
de: schreibe DWord

# btnWriteExample_Text
source: write functions
de: Schreib- funktionen

# btnwriteInt_Text
source: write int
de: schreibe Int

# btnwriteReal_Text
source: write real
de: schreibe Real

# btnwriteS5Time_Text
source: write S5Time
de: schreibe S5Time

# btnwriteS7_String_Text
source: write s7string
de: schreibe S7String

# btnwriteString_Text
source: write string
de: schreibe String

# btnwriteWord_Text
source: write word
de: schreibe Word

# chkAllowMultipleBits_Text
source: allow muliple bits
de: erlaube schreiben von multiplen Bits

# chkAsyncConnect_TextAsync
source: connect asynchronous
de: asynchron verbinden

# chkIsWriteImageActive_Text
source: image active
de: Abbild schreiben

# chkIsWriteLogActive_Text
source: log output active
de: Log-Ausgabe aktiv

# chkOptimized_Text
source: read with Optimize Mode 'On'
de: lese mit Optimize Mode 'On'

# chkSingleValue_Text
source: single value
de: Einzelwert

source: connect unsuccessful!
de: Verbindung nicht erfolgreich!

# Continue_Question
source: Do you want to continue?
de: Wollen Sie fortfahren?

# Continue_Warning_Delete
source: Important: If you continue, the target block will be deleted without further request.
de: Wichtig: Wenn Sie fortfahren wird der Zielblock ohne weitere Nachfrage gelöscht!

# Continue_Warning_Restore
source: Important: If you continue, the target block will be written. Existing data will be overwritten without further request.
de: Wichtig: Wenn Sie fortfahren wird der Zielblock beschrieben. Existierende Blöcke werden ohne weitere Nachfrage überschrieben!

# Continue_Warning_SetTime
source: Important: If you continue, the plctime will be overwritten without further request.
de: Wichtig: Wenn Sie fortfahren wird die Uhrzeit der SPS ohne weitere Nachfrage überschrieben

# Continue_Warning_Start
source: Important: If you continue, the plc will be started without further request.
de: Wichtig: Wenn Sie fortfahren wird die SPS ohne weitere Nachfrage gestartet!

# Continue_Warning_Stop
source: Important: If you continue, the plc will be stopped without further request.
de: Wichtig: Wenn Sie fortfahren wird die SPS ohne weitere Nachfrage gestopt!

# Continue_Warning_Write
source: Important: If you continue, the target adress will be written. Existing data will be overwritten without further request.
de: Wichtig: Wenn Sie fortfahren wird die abgegebene Adresse beschrieben. Existierende Daten werden ohne weitere Nachfrage überschrieben!

# grbConnection_Text
source: Connection settings
de: Verbindungseinstellungen

# grbDatabaseConnectorSettings_Text
source: Database connector settings
de: Datenbank Connector Einstellungen

# grbFilesystemConnectorSettings_Text
source: Filesystem connector settings
de: Filesystem Connector Einstellungen

# grpAccess_Text
source: Access
de: Zugriff

# grpAction_Text
source: Action
de: Aktion

# grpAction_Text1
source: action
de: Aktion

# grpAddress_Text
source: add request
de: Requests definieren

# grpAdress_Text
source: Adress
de: Adresse

# grpResult_Text
source: Result
de: Ergebnis

# Hint_Read_OptimizationMode_Overview
source: Explanation of the read optimization mode
de: Erklärung des Lese-Optimierungs-Modus

# Hint_Read_OptimizationMode_Text
source: NONE: No optimization, all read requests are read one after the other. Safe but slow. CROSS_AREAS: In CROSS_AREAS mode, the read requests are merged across areas. Advantage: fragmented areas (e.g., data across multiple datablocks) can be read and written simultaneously COMBINE_AREAS: In COMBINE_AREAS mode, read requests from the same areas are combined. Advantage: Fast and high-performance access to data of the same areas (for example, data in the same datablock) AUTO: PLCcom automatically selects the best optimization method. Only the minimum required PLC read accesses are carried out. Only in Expert edition available
de: NONE: Keine Optimierung, alle Read Requests werden nacheinander gelesen. Sicher aber langsam. CROSS_AREAS: Im CROSS_AREAS Modus werden die Lese- Anforderungen bereichsübergreifend zusammengeführt. Vorteil: Fragmentierte Bereiche (z. B. Daten über mehrere Datenblöcke) können gleichzeitig gelesen und geschrieben werden COMBINE_AREAS: Im COMBINE_AREAS Modus werden Lese-Anforderungen aus denselben Bereichen kombiniert. Vorteil: Schneller und performanter Zugriff auf Daten derselben Bereiche (z. B. Daten in demselben Datenblock) AUTO: PLCcom wählt automatisch die beste Optimierungsmethode für die Read Requests aus. Es werden nur die minimal erforderlichen SPS-Zugriffe durchgeführt. Nur in der Expert Edition verfügbar

# Hint_Write_OptimizationMode_Overview
source: Explanation of the write optimization mode
de: Erklärung des Schreib-Optimierungs-Modus

# Hint_Write_OptimizationMode_Text
source: NONE: No optimization, all read requests are written one after the other. Safe but slow. CROSS_AREAS: In CROSS_AREAS mode, the read requests are merged across areas. Advantage: fragmented areas (e.g., data across multiple datablocks) can be read and written simultaneously
de: NONE: Keine Optimierung, alle Write Requests werden nacheinander geschrieben. Sicher aber langsam. CROSS_AREAS: Im CROSS_AREAS Modus werden die Schreib- Anforderungen bereichsübergreifend zusammengeführt. Vorteil: Fragmentierte Bereiche (z. B. Daten über mehrere Datenblöcke) können gleichzeitig gelesen und geschrieben werden

# Important_question
source: Attention
de: Achtung

# lblAutoConnect2
source: auto connect
de: autom. verbinden

# lblBit_Text
source: Bit (only for bit operations)
de: Bit (nur für Bit-Operationen)

# lblBusAdressLocal_Text
source: busAdressLocal
de: Bus-Adresse-Local

# lblBusAdressPLC_Text
source: busAdressPLC
de: Bus-Adresse-SPS

# lblConnectionMessage_Text
source: PLCCom supports all database connections that derive from DbConnection- Object. PLCCom been tested with: => Oracle => MS SQL-Server => MySQL => PostgresSQL => OdbcConnection => OleConnection => Firebird => SQLITE
de: PLCcom unterstützt sämtliche Datenbankverbindungen die vom DbConnection- Object abstammen. PLCcom wurde getestet mit: => Oracle => MS SQL-Server => MySQL => PostgresSQL => OdbcConnection => OleConnection => Firebird => SQLITE

# lblConnectionType_Text
source: connection type
de: Verbindungstyp

# lblConnectorName_Text
source: new connector name
de: Name des Connectors

# lblConnectorType_Text
source: type of new connector
de: Type des Connectors

# lblDataType_Text
source: data type
de: Datentyp

# lblDB_Text
source: DB (only for DB, use 0 otherwise)
de: DB (nur für Bereich DB, ansonsten 0)

# lblEncryptionPassword_Text
source: encryption password (empty = no encryption)
de: Verschlüsselungspasswort (leer = k. Verschlüsselung)

# lblFolderName_Text
source: target folder
de: Ziel-Ordner

# lblFunction_Text
source: function
de: Funktion

# lblImageOutputFormat_Text
source: image output format
de: Abbild-Ausgabe-Format

# lblInfoConnectionString_Text
source: <= The connection string for the database connection. In this example, only MS SQL Server
de: <= Der Connectionstring zur Datenbankverbindung. In diesem Beispiel nur MS SQL-Server

# lblInfoConnectorName_Text
source: <= The desired name of new connector. Name must be unique
de: <= Der gewünschte Name des Connectors. Der Name muss eindeutig sein!

# lblInfoCreateListener_Text
source: ‚Logging-Connectors‘ store read variable data to the file system or a SQL database for further use. Due to not included database provider this example just shows filesystem and SQL-Server connections.
de: Mit Logging-Connectoren können Daten der gelesenen Variablen im Filesystem oder in einer SQL-Datenbank für die weitere Verwendung abgelegt werden. Aufgrund nicht mitgelieferter Datenbankprovider werden in diesem Beispiel nur Filesystem- und SQL-Server- Verbindungen angeboten.

# lblInfoEncryptionPassword_Text
source: <= If you enter an encryption password, the data is stored in encrypted form. You can read the data using the supplied decryption tool again.
de: <= Wenn Sie ein Verschlüsselungspasswort eingeben, werden die Daten verschlüsselt abgelegt. Sie können die Daten mit dem Entschlüsselungstool wieder einlesen.

# lblInfoFolderName_Text
source: <=The desired output folder for the log files and the data image.
de: <= Der gewünschte Ausgabe-Ordner für die Logfiles und das Datenabbild.

# lblInfoImageOutputFormat_Text
source: <= You can output the data for the image in shallow .dat format (csv) or in .xml format
de: <= Sie können sich die Daten für das Abbild im flachen .dat-Format (csv) oder im .xml-Format ausgeben lassen

# lblInfoIsWriteImageActiveDB_Text
source: <= Allows you to write the current server data image in a database table for your further use
de: <= Ermöglicht Ihnen das Schreiben des aktuellen Server-Daten-Abbildes in eine Datenbanktabelle zu Ihrer weiteren Verwendung

# lblInfoIsWriteImageActive_Text
source: <= Allows you to write the current server data image in the file system for your further use
de: <= Ermöglicht Ihnen das Schreiben des aktuellen Server-Daten-Abbildes in das Filesystem zu Ihrer weiteren Verwendung

# lblInfoIsWriteLogActiveDB_Text
source: <=Turns data output in a log table archive on or off
de: <= Schaltet die Datenausgabe in eine Log-Archiv-Tabelle ein oder aus

# lblInfoIsWriteLogActive_Text
source: <=Turns data output in a log archive on or off
de: <= Schaltet die Datenausgabe in ein Log-Archiv ein oder aus

# lblInfoMaxAgeHours_Text
source: <= You can restrict the maximum age of files. When the value is exceeded the old files are automatically deleted. -1 = Disabled.
de: <= Sie können das maximale Alter von Dateien einschränken. Bei Überschreitung des Wertes werden alten Dateien automatisch gelöscht. -1 = deaktiviert.

# lblInfoMaxFileSizeMB_Text
source: <= You can restrict the maximum size of files. When the value is exceeded the old files are automatically deleted. -1 = Disabled.
de: <= Sie können das maximale Größe von Dateien einschränken. Bei Überschreitung des Wertes werden alten Dateien automatisch gelöscht. -1 = deaktiviert.

# lblInfoMaxNumberOfLogFiles_Text
source: <= You can restrict the maximum number of files. When the value is exceeded the old files are automatically deleted. -1 = Disabled.
de: <= Sie können die maximale Anzahl von Dateien einschränken. Bei Überschreitung des Wertes werden alten Dateien automatisch gelöscht. -1 = deaktiviert.

# lblIsWriteImageActiveDB_Text
source: <= Allows you to write the current server data image in the file system for your further use
de: <= Ermöglicht Ihnen das Schreiben des aktuellen Server-Daten-Abbildes in eine Datenbanktabelle zu Ihrer weiteren Verwendung

# lblLanguage_Text
source: language
de: Sprache / Language

# lblLength_Text
source: Quantity
de: Anzahl

# lblLog_Text
source: diagnostic output
de: Diagnose-Ausgabe

# lblMaxAgeHours_Text
source: max age in hours
de: max Alter in Stunden

# lblMaxFileSizeMB_Text
source: max file size in MB
de: max Dateigrösse in MB

# lblmaxIdleTime_Text
source: max. idle time until closing the port
de: max. Ruhezeit bis zur Trennung

# lblMaxNumberOfLogFiles_Text
source: max number of log files
de: max Anzahl Log-Dateien

# lblMessage_Text
source: Message
de: Meldung

# lblMode_Text
source: read / write mode
de: Lese-/Schreib- Modus

# lblMultipleValues_Text
source: Please enter the values separated by return:
de: Bitte geben Sie die Werte ein und schliessen mit Enter ab:

# lblOperationOrder_Text
source: prioritization
de: Priorisierung

# lblPLCType_Text
source: PLC type
de: SPS-Typ

# lblReadAddress_Text
source: read address
de: Leseadresse

# lblReadOptimizationMode_Text
source: Read optimization
de: Lese-Optimierung

# lblRegion_Text
source: Region
de: Bereich

# lblSerialCode_Text
source: enter serialcode first >>>>>>>>>
de: Bitte geben Sie zuerst Ihren Serialcode ein >>>

# lblStartAdress_Text
source: startadress (usually in bytes)
de: Startadresse (in Bytes)

# lblValues_Text
source: Please enter the desired value:
de: Bitte geben Sie den gewünschten Wert ein:

# lblWriteAddress_Text
source: write address
de: Schreibadresse

# lblWriteOptimizationMode_Text
source: Write optimization
de: Schreib-Optimierung

# logo_compatibel_is_obsolete
source: ePLCType member Logo_compatibel is obsolete please use Logo0BA7_compatibel or Logo0BA8_compatibel
de: ePLCType member Logo_compatibel ist veraltet! Bitte benutzen Sie Logo0BA7_compatibel oder Logo0BA8_compatibel

# main_Text
source: Start Example
de: Start Beispielanwendung

source: Message
de: Meldung

# MessageText
source: Messsage:
de: Meldung:

# Message_ReadCollection
source: before you could use the 'Read Collection' option, you have to configure the marked region (Edit Collection) code-area!
de: Bevor Sie die Funktion'Lesen Collection' verwenden, müssen Sie den markierten Bereich (Bearbeiten Collection) im Code-Bereich konfigurieren!

source: not successful deleted
de: nicht erfolgreich geloescht

source: operation aborted
de: Funktion abgebrochen

# OptimizationMode_AUTO_Text
source: PLCcom automatically selects the best optimization method. Only the minimum required PLC read accesses are carried out. Only in Expert edition available
de: PLCcom wählt automatisch die beste Optimierungsmethode für die Read Requests aus. Es werden nur die minimal erforderlichen SPS-Zugriffe durchgeführt. Nur in der Expert Edition verfügbar

# OptimizationMode_COMBINE_AREAS_Text
source: In COMBINE_AREAS mode, read requests from the same areas are combined. Advantage: Fast and high-performance access to data of the same areas (for example, data in the same datablock)
de: Im COMBINE_AREAS Modus werden Lese-Anforderungen aus denselben Bereichen kombiniert. Vorteil: Schneller und performanter Zugriff auf Daten derselben Bereiche (z. B. Daten in demselben Datenblock)

# OptimizationMode_CROSS_AREAS_Text
source: In CROSS_AREAS mode, the read requests are merged across areas. Advantage: fragmented areas (e.g., data across multiple datablocks) can be read and written simultaneously
de: Im CROSS_AREAS Modus werden die Lese- Anforderungen bereichsübergreifend zusammengeführt. Vorteil: Fragmentierte Bereiche (z. B. Daten über mehrere Datenblöcke) können gleichzeitig gelesen und geschrieben werden

# OptimizationMode_NONE_Text
source: No optimization, all read requests are read or written one after the other. Stable but slow. Only recommended for troubleshooting.
de: Keine Optimierung, alle Read Requests werden nacheinander gelesen oder geschrieben. Stabil aber langsam. Nur zur Fehlerbehebung empfohlen.

# ParseError
source: Error occured while parsing! valuestring is not valid!
de: Fehler beim Parsen aufgetreten! Valuestring ist ungültig!

source: Project Import done!
de: Projekt Import abgeschlossen!

source: Project Import starts...
de: Projekt Import startet...

# rbRead_Text
source: read on PLC
de: SPS lesen

# rbWrite_Text
source: write to PLC
de: SPS schreiben

source: read
de: lesen

source: reading blocklist
de: Lese Blockliste

source: starting backup
de: Starte Sicherung

# State_closed
source: Disconnected
de: Getrennt

# State_closing
source: Closing...
de: Verbindungstrennung...

# State_connected
source: Connected
de: Verbunden

# State_connecting
source: Connecting...
de: Verbindungsaufbau...

# successfully_saved
source: Data saved successfully!
de: Daten erfolgreich gespeichert!

source: successful deleted
de: erfolgreich geloescht

# successful_saved
source: successful saved in
de: erfolgreich gespeichert in

# successful_saved_PLC
source: successful saved in PLC from File
de: erfolgreich in der SPS gespeichert aus Datei

source: Timestamp
de: Zeitstempel

# to_many_windows
source: Too many windows open! Please close all child window first!
de: Zuviele Fenster offen! Bitte schliessen Sie zuerst alle untergeordneten Fenster!

# txtInfoBF_Text
source: In this window you can read the object list, call up the length of individual objects. In addition, functions for backup and restore are available.
de: In diesem Fenster können Sie die Objektliste einlesen, die Länge einzelner Objekte abrufen. Außerdem stehen Funktionen für Backup und Restore zur Verfügung.

# txtInfoDocu_Text_DB
source: You can find help in the document 'Documentation_PLCcom_database_interface_english.pdf'
de: Sie finden Hilfe im Dokument 'Documentation_PLCcom_database_interface_german.pdf'

# txtInfoDocu_Text_file
source: You can find help in the document 'Documentation_PLCCom_interface_for_filesystem_english.pdf'
de: Sie finden Hilfe im Dokument 'Documentation_PLCCom_interface_for_filesystem_german.pdf'

# txtInfoDS_Text
source: The PLCCom data server monitors autonomous data in the PLC in an adjustable cycle and notifies the parent software for a change with an event.
de: Der PLCcom-Datenserver überwacht eigenständig Daten in der SPS in einem einstellbaren Zyklus und benachrichtigt die übergeordnete Software bei einer Veränderung mit einem Event.

# txtInfoLI_Text
source: Thank you for using our PLCCom component. Before you can run PLCCom, please enter your license information. Please take the data from the email that you received after download, or from your license certificate.
de: Vielen Dank für die Nutzung unserer PLCcom-Komponente. Bevor sie PLCcom ausführen können, geben Sie bitte Ihre Lizenz-Informationen ein. Entnehmen Sie diese Daten bitte der eMail, die Sie nach dem Download erhalten haben, oder Ihrem Lizenzzertifikat.

# txtInfoLoggingConnectors_Text
source: ‚Logging-Connectors‘ store read variable data to the file system or a SQL database for further use. Continuous archiving and saving an Image with just a few rows of code.
de: Mit Logging-Connectoren können Daten der gelesenen Variablen im Filesystem oder in einer SQL-Datenbank für die weitere Verwendung abgelegt werden. Fortlaufende Archivierung und Erzeugen eines Abildes mit wenigen Zeilen Code.

# txtInfoLoggingDefinedConnectors_Text
source: defined logging connectors
de: definierte Logging-Konnektoren

# txtInfoOF_Text
source: In this window, you can start and stop the PLC. In addition, you can reading basic data from hardware, get and set PLC-clock and retrieve diagnostic data.
de: In diesem Fenster können Sie die die SPS starten und stoppen. Außerdem können die Daten aus der Hardware auslesen, die Uhr lesen und setzen sowie Diagnostikdaten von der SPS abfragen.

# txtInfoRB_OR_Text
source: You can execute single read and write processes on this window. For optimized read processes please use the ReadDataRequestCollection.
de: In diesem Fenster können einzelne Lese- oder Schreibvorgänge durchgeführt werden. Für optimierte Lesevorgänge benutzen Sie bitte die ReadDataRequestCollection.

# txtInfoRCB_Text
source: ReadWriteRequestSet: read and write processes will be assembled and optimized due to minimize the necessary PLC accesses.
de: Bei Benutzung des ReadWriteRequestSet werden Lese-Schreib-Vorgänge logisch optimiert, sodass nur die minimal notwendigen Zugriffe auf die SPS erfolgen.

# txtInfoRequest_Text
source: In this window, individual requests can be defined for read or write operations. You can read the result at the bottom of the text box.
de: In diesem Fenster können einzelne Requests für Lese- oder Schreibvorgänge definiert werden. Das Ergebnis können sie unten in der Textbox ablesen.

# txtInfosSymbRBText
source: In this window, you can read or write symbolic variables.
de: In diesem Fenster können Sie symbolische Variablen lesen oder schreiben.
