Repository: Indi-An/PLCcomforS7-examples-dotnet
Catalog: Full-Test-App/Properties/Resources.*.resx
Languages: de

# txtWarning_Text
source: This example program shows you all provided PLCCom functions. It also offers easy code examples for a better understanding of the program interface. Caution: With the product ‘PLCCom’ and also with the example code, the user or third party will be put in a position to control plants, machines or similar. Directly changes to a connected PLC are possible. It is possible that machines with moving part startup without advance warnings. This could causes severe injuries till death. Ensure that nobody gets into danger due to your work. Please make sure that you know what you do! Also see the EULAs warning note.
de: Dieses Beispielprogramm dient Ihnen zur Anschauung, welche Funktionen Ihnen mit PLCCom zur Verfügung gestellt werden. Außerdem bietet es einfache Programmierbeispiele, zum schnellen Verstehen der Programm-Schnittstelle. Warnung: Mit dem Produkt PLCcom und auch mit diesem Beispielcode werden Sie oder Dritte in die Lage versetzt nach eigenem Ermessen Anlagen, Maschinen oder Ähnliches zu überwachen und zu steuern. Es wird dem Anwender ermöglicht direkt Änderungen an einer verbundenen SPS durchzuführen. Hierzu muss der Benutzer eigenes Wissen bzw. diverse Tätigkeiten einfließen lassen. Hierdurch könnten z.B. bewegliche Teile an Maschinen ohne Vorwarnung anlaufen. Schwere Verletzungen bis hin zum Tode sind möglich. Deshalb: Stellen Sie deshalb unbedingt sicher, dass durch Ihre Arbeiten niemand in Gefahr gerät! Führen Sie nur Aktionen durch, bei denen Sie genau wissen was Sie tun. Beachten Sie auch die Sicherheitshinweise in der EULA.

source: undefinend connection type
de: undefinierter Verbindungstyp

source: undefinend PLC type
de: undefinierter SPS-Typ

# warning_allow_multiple_bits
source: Important: If multiple bits are present, this WriteRequest can not be processed optimally. All bits are written one after the other. It is better and more efficient if a separate WriteRequest is used for each bit.
de: Wichtig: Wenn mehrere Bits in einem Request vorhanden sind, kann dieser WriteRequest nicht optimal verarbeitet werden. Alle Bits werden nacheinander geschrieben. Besser und effizienter ist es, wenn für jedes Bit ein eigener WriteRequest verwendet wird.

source: write
de: schreiben

# wrong_datatype
source: unknown data type
de: unbekannter Datentyp

# captionPlcTypeHelp
source: Plc type decision help
de: Entscheidungshilfe SPS Type

# messagePlcTypeHelp
source: Please select the appropriate PLC type from the list opposite. If you want to access a 1200 or 1500 PLC symbolically, please select the type: Symbolic_Tls13 Please note: Certain requirements must be met for symbolic access: 1. at least HMI access must be enabled in the controller without a password as a protection level. 2. the controller must have been created with at least TIA version 17. If a data block has been created with a previous version, it must have been recompiled once with TIA from V17. 3. at least the following firmware versions are required: - S7-1200 from V4.5 - S7-1500 from V2.9
de: Bitte wählen Sie den für die passenden SPS Type aus der nebenstehenden Liste. Wenn Sie symbolisch auf eine 1200er oder 1500er SPS zugreifen möchten, wählen Sie bitte den Typen: Symbolic_Tls13 Bitte beachten Sie: Für einen symbolischen Zugriff müssen bestimmte Vorrausetzungen erfüllt sein: 1. Als Schutzstufe muss mindestens der HMI-Zugriff muss in der Steuerung ohne Passwort freigegeben sein. 2. Die Steuerung muss mindestens mit der TIA-Version 17 erstellt worden sein. Wenn ein Datenbaustein mit einer vorherigen Version erstellt worden sein, so muss er einmal mit TIA ab V17 neu übersetzt worden sein. 3. Es sind mindestens folgende Firmware-Versionen notwendig: - S7-1200 ab V4.5 - S7-1500 ab V2.9

# lblPlcPassword_Text
source: Plc Password
de: SPS Passwort

# lblSerialLimited_Text
source: Note: Without a license key, the runtime is limited to 15 minutes
de: Hinweis: Ohne Lizenzschlüssel ist die Laufzeit auf 15 Minuten begrenzt.
